Revit 2020 API
EnergyAnalysisOpening Properties
The EnergyAnalysisOpening type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CADLinkUniqueId
 The unique id of the originating CAD object's link (linked document) associated with this opening.
CADObjectUniqueId
 The unique id of the originating CAD object (model element) associated with this opening.
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
Corner
 The lower-left coordinate for the analytical rectangular geometry viewed from outside.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Height
 The height of the analytical rectangular geometry.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
A human readable name for the Element.
 (Inherited from Element.)
OpeningId
 The unique identifier for the opening.
OpeningName
 The unique name identifier for the opening.
OpeningType
 The analytical opening type.
OriginatingElementDescription
 The description for the originating Revit element.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Type
 The gbXML opening type attribute.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Width
 The width of the analytical rectangular geometry.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace